Class-Documents/Project05.tex
% Created 2024-04-03 Wed 13:59
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{minted}
\usepackage{placeins}
\usepackage{gensymb}
\usepackage{hyperref}
\hypersetup{colorlinks=true,urlcolor=cyan, linkcolor=blue}
\author{Christian Johnson\and\&\and Dan Nusraty\and\&\and Dylan McGill\and\newline Optimail}
\date{\today}
\title{Mail Database Project}
\hypersetup{
 pdfauthor={Christian Johnson\and\&\and Dan Nusraty\and\&\and Dylan McGill\and\newline Optimail},
 pdftitle={Mail Database Project},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 29.3 (Org mode 9.6.15)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents

\newpage

\section{Preface}
\label{sec:org647b7b4}
Tasks taken to complete this assignment:
\begin{itemize}
\item Compiled all code files and class documents to Git repo
\item Went over code structure and general function of the system in its current state
\item Discussed how best to test various components of the application
\item Tested several components of the system
\item Fixed issues with application
\item Pushed working, fixed code to Github \(\newline\)
\end{itemize}
Changelog:
\begin{itemize}
\item Tables are more visually appealing
\item Added a logout button (currently non-functional)
\item Added USCGA logo
\item Tables now resize automatically (will shrink if empty, also allows app to fullscreen)
\item Added search capability to Data tab
\item Added Delete capability to Data tab
\item Added edit button to Data tab, now raises submenu when clicked (main functionality still WIP)
\end{itemize}


\section{Test Plan}
\label{sec:orgac19426}
\subsection{Unit Testing}
\label{sec:org0be55ba}
\emph{Note:} These tests will have to be performed manually, as our app is primarily GUI focused.
\(\\\\\)
\textbf{Login:}
\begin{itemize}
\item This test verifies the behavior of the login screen.
\item It checks if the screen redirects the user to the Home screen upon successful login with valid credentials.
\item Since the app is GUI-focused, this test would involve manually entering valid credentials and observing the redirection to the Home screen.
\item Input: Correct Username and Password
\item Expected output: Homescreen Appears
\end{itemize}
\(\\\)
\textbf{Data Entry:}
\begin{itemize}
\item This test ensures that the "Add Package" button correctly records data.
\item It specifically checks if the tracking number is recorded accurately and if the package is associated with the correct cadet.
\item Manual interaction with the GUI would be required to input data and verify the recorded information.
\item Input: Tracking number (TrackNum) and Box Number (BoxNum)
\item Expected output: Entry to database with TrackNum and Cadet Info for cadet associated with BoxNum
\end{itemize}
\(\\\)
\textbf{Search Function:}
\begin{itemize}
\item This test validates the search functionality.
\item It verifies that a search returns all valid results or, alternatively, that it does not return any invalid results.
\item Again, manual interaction with the GUI is necessary to perform searches and confirm the correctness of the results.
\item Input: search query, example \texttt{Tracking Number: 123}
\item Expected Output: All packages with \texttt{123} in the tracking number
\end{itemize}


\subsection{System Testing}
\label{sec:org8db1bd1}
\emph{Note:} Testing the integrations between various components of the system

\textbf{Database Integration}
\begin{itemize}
\item Verify that the data entered through the GUI is correctly stored in the database.
\item Test if package information, including tracking numbers and associated cadet details, is accurately saved in the database after clicking the "Add Package" button.
\item Ensure that the search functionality retrieves the correct data from the database.
\item Input: text in GUI fields
\item Expected output: Text is read from fields and stored in Database
\end{itemize}
\(\\\)
\textbf{Email Notification Integration}
\begin{itemize}
\item Test if the email notification feature functions as expected.
\item Verify that when a package is added and associated with a cadet, an email notification is sent to the corresponding cadet's email address.
\item Check if the content of the email notification contains accurate package information.
\item Input: User records new package
\item Expected output: Email is sent to the same cadet to whom the package is addressed.
\end{itemize}
\(\\\)
\textbf{User Authentication Integration}
\begin{itemize}
\item Ensure that the login screen interacts correctly with the authentication system.
\item Test if valid credentials provided on the login screen authenticate the user and grant access to the application's features.
\item Verify that invalid credentials result in appropriate error messages or prevent access to sensitive functionalities.
\item Input: Correct Username and Password
\item Expected output: Authenticates user and displays home screen
\item Input: Incorrect Username and Password
\item Expected output: Does not authenticate, displays error message
\end{itemize}
\(\\\)
\textbf{GUI Navigation Integration}
\begin{itemize}
\item Test the navigation flow between different screens or tabs of the GUI.
\item Verify that users can seamlessly switch between tabs/screens without encountering errors or unexpected behavior.
\item Ensure that data entered in one tab/screen remains consistent and accessible when navigating to another tab/screen.
\item Input: Clicking on navigation button
\item Expected Output: Displaying a new screen
\end{itemize}
\(\\\)
\textbf{Report Generation Integration}
\begin{itemize}
\item Verify that the report generation feature utilizes the correct data from the database.
\item Test if generated reports accurately reflect the package tracking data stored in the database.
\item Check if generated reports can be exported/downloaded in the desired format (e.g., PDF, Excel).
\item Input: Data from database
\item Expected output: Graph
\end{itemize}

\subsection{Defect tracking}
\label{sec:orgea6bdc9}
We plan to use the "Issues" functionality built in to Github.
When a team member or test user notices an issue with the application, they can submit an Issue on Github detailing the process for reproducing the issue, as well as potential expected outcomes.

\subsection{Test Schedule}
\label{sec:orgcab424b}
Unit testing will be an ongoing process throughout the development lifecycle, ensuring the proper function of each application component as it is completed. Prior to integration testing, another round of unit testing will occur once all major functionalities are implemented. Integration testing will commence once the application reaches a usable state, which we anticipate to be approximately 1-2 weeks from now.

\section{Working Prototype}
\label{sec:org0073e56}

\href{https://github.com/CSJ7701/Mail-Database-Project/commit/762f2ca7f4a92c6ccd8447d39f276ba7ef0a6cc4}{Github Repo}

\section{Demonstration Video}
\label{sec:org4f4805f}

\href{https://github.com/CSJ7701/Mail-Database-Project/blob/main/Class-Documents/Recording.webm}{Video Link}\(\\\)
Click "View Raw" on Github to download the video file.

\section{Project Management}
\label{sec:orga3650ea}

\subsection{Schedule}
\label{sec:org8aa542b}
\textbf{Next Up:}
\begin{itemize}
\item Finalize "Manage DB" tab and polish the user interface (Effort - 4)
\item Create "Settings" tab and allow for user specific configuration settings (Effort - 8)
\item Implement Logout Button (Effort - 3)
\item Create "Reports" tab and determine what types of reports to logically implement (Effort - 9)\(\\\)
\end{itemize}
\textbf{Long Term:}
\begin{itemize}
\item Implement physical scanner (Effort - 6)
\item Create larger example database to full scale test (Effort - 6)
\item Optimize code (Effort - 7)
\item Allow file operations, to export/import/backup actual database file. (Effort - 8)
\end{itemize}


\subsection{Meeting Summaries}
\label{sec:org24dcbdb}
\textbf{Meeting 1}
\begin{itemize}
\item Reviewed Previous work and compiled upcoming plan
\item Worked on "Manage DB tab" in a group environment\(\\\)
\end{itemize}
\textbf{Meeting 2}
\begin{itemize}
\item Discussed test plans, and how to put one together.
\item Began work on Phase 05.
\item Added finishing touches to code in order to present the "Working prototype" for core functionality.\(\\\)
\end{itemize}
\textbf{Meeting 3}
\begin{itemize}
\item Worked on test plans.
\item Recorded demonstration video.
\end{itemize}
\end{document}
